projects/beckmanl/dominion/Assignment-5.org
#+TITLE: Assignment 5
#+SETUPFILE: ~/main.org


* Bugs Report
** Bug 1
   
- Title: Wrong Smithy draw card value. 
- Project: dominion
- Reporter: liam beckman
- Date: 16 March 2019
- Type: Bug
- File Name: cardtest1.c
- Environment: NVIM v0.3.4 (Build type: Release)
- Description:

The Smithy card (implemented in the ~play_smithy~ function) drew a totoal of four cards, instead of the correct amount of three cards. This is likely due to the incorrect termination expression of ~i < 4~ in the primary for loop.

 #+BEGIN_SRC c -n
int play_smithy(int currentPlayer, int handPos, struct gameState *state)
{
        //+3 Cards
      for (int i = 0; i < 4; i++)
    {
      drawCard(currentPlayer, state);
    }
            
      //discard card from hand
      discardCard(handPos, currentPlayer, state, 0);
      return 0;
}
 #+END_SRC

** Bug 2

- Title: Adventurer Card Error
- Project: dominion
- Reporter: liam beckman
- Date: 16 March 2019
- Type: Bug
- File Name: cardtest2.c
- Environment: NVIM v0.3.4 (Build type: Release)
- Description:

    Uninitialized variable ~z~ in ~play_adventurer~ function within the ~temphand[z]=cardDrawn~ statement. Furthermore, the ~z~ variable is not incremented after the ~temphand[z]=cardDrawn~ statement, so the first temphand card will continualy be overwritten every iteration of the ~while(drawntreasure<2)~ statement.

    #+BEGIN_SRC c -n
while(drawntreasure<2)

//...

    if (cardDrawn == copper || cardDrawn == silver || cardDrawn == gold)
        drawntreasure++;
    else
    {
        temphand[z]=cardDrawn;
        state->
    handCount[currentPlayer]--; //this should just remove the top card (the most recently drawn one).
    }


    #+END_SRC

* Test Report
  
I chose to use Yan Ming's branch for their second assignment (yanme-assignment-2), as her later branches were such that no prominent bugs could be found. Thus, I am confident in saying that their code is reliable and well executed, as I was forced to analyze code with purposeful bugs implemented.

** Manual Review
*** cardEffect

    Missing end bracket in ~cardEffect~ function.

    #+BEGIN_SRC c -n
int cardEffect(int card, int choice1, int choice2, int choice3, struct gameState *state, int handPos, int *bonus)

// ...
    #+END_SRC


    Variable misspelling of ~drawnteasure~ variable in ~play_adventurer~ function. Initialized as ~drawnteasure~.

*** play_adventurer

    #+BEGIN_SRC c -n -n
int play_adventurer(int currentPlayer, int temphand[MAX_HAND],  struct gameState *state)


int drawnteasure = 0;
int cardDrawn;
while(drawntreasure<2)

    // ...
    #+END_SRC

    Uninitialized variable ~z~ in ~play_adventurer~ function within the ~temphand[z]=cardDrawn~ statement. Furthermore, the ~z~ variable is not incremented after the ~temphand[z]=cardDrawn~ statement, so the first temphand card will continualy be overwritten every iteration of the ~while(drawntreasure<2)~ statement.


    #+BEGIN_SRC c -n
while(drawntreasure<2)

//...

    if (cardDrawn == copper || cardDrawn == silver || cardDrawn == gold)
        drawntreasure++;
    else
    {
        temphand[z]=cardDrawn;
        state->
    handCount[currentPlayer]--; //this should just remove the top card (the most recently drawn one).
    }


    #+END_SRC

*** play_smithy

    Uninitialized variable ~i~ in ~play_smithy~ function.

    #+BEGIN_SRC c -n
int play_smithy(int currentPlayer, int handPos, struct gameState *state)

//+3 Cards
    for (i = 0; i < 4; i++)

        // ...
    #+END_SRC

*** play_mine

    Uninitialized variables ~j~ and ~i~ in ~play_mine~ function.

    #+BEGIN_SRC c -n
int play_mine ( int currentPlayer, int choice1, int choice2, struct gameState *state)

    j = state->
    hand[currentPlayer][choice1];  //store card we will trash

// ...

//discard trashed card
for (i = 0; i < state->
    handCount[currentPlayer]; i++)
{
    if (state->
    hand[currentPlayer][i] == j)
    {
        discardCard(i, currentPlayer, state, 0);
        break;
    }
}

return 0;

    #+END_SRC

    Undeclared variable ~handPos~ in ~play_mine~ function.

    #+BEGIN_SRC c -n
int play_mine ( int currentPlayer, int choice1, int choice2, struct gameState *state)

// ...

//discard card from hand
    discardCard(handPos, currentPlayer, state, 0);
    #+END_SRC

*** play_council

    Uninitialized variable ~i~ in ~play_council~ function.

    #+BEGIN_SRC c -n
int play_council(int currentPlayer, int handPos, struct gameState *state)
{
    //+4 Cards
    for (i = 0; i < 4; i++)

        // ...
    #+END_SRC


** Unit Testing

*** Test Results  
   
**** getCost Function
     #+BEGIN_EXAMPLE -n
unittest1.c:17 TEST SUCCESSFULLY COMPLETED ->
     getCost(0) == 0
unittest1.c:20 TEST SUCCESSFULLY COMPLETED ->
     getCost(1) == 2
unittest1.c:23 TEST SUCCESSFULLY COMPLETED ->
     getCost(2) == 5
unittest1.c:26 TEST SUCCESSFULLY COMPLETED ->
     getCost(3) == 8
unittest1.c:29 TEST SUCCESSFULLY COMPLETED ->
     getCost(4) == 0
     #+END_EXAMPLE
    
**** isGameOver Function
     #+BEGIN_EXAMPLE -n
unittest2.c:28 TEST SUCCESSFULLY COMPLETED ->
     isGameOver(&testGame) == 0
unittest2.c:35 TEST SUCCESSFULLY COMPLETED ->
     isGameOver(&testGame) == 1
unittest2.c:43 TEST SUCCESSFULLY COMPLETED ->
     isGameOver(&testGame) == 0
unittest2.c:46 TEST SUCCESSFULLY COMPLETED ->
     isGameOver(&testGame) == 1
     #+END_EXAMPLE
    
**** compare Function
     #+BEGIN_EXAMPLE -n
unittest3.c:14 TEST SUCCESSFULLY COMPLETED ->
     compare(b, a) == 1
unittest3.c:15 TEST SUCCESSFULLY COMPLETED ->
     compare(a, b) == -1
unittest3.c:16 TEST SUCCESSFULLY COMPLETED ->
     compare(a, a) == 0
unittest3.c:17 TEST SUCCESSFULLY COMPLETED ->
     compare(b, b) == 0
     #+END_EXAMPLE
    
**** updateCoins Function
     #+BEGIN_EXAMPLE -n
unittest4.c:31 TEST SUCCESSFULLY COMPLETED ->
     testGame->coins == 9
unittest4.c:43 TEST SUCCESSFULLY COMPLETED ->
     testGame->coins == 8
     #+END_EXAMPLE

**** Smithy Card
    
***** Failed Tests

     #+BEGIN_EXAMPLE -n
cardtest1.c:14 TEST SUCCESSFULLY COMPLETED ->
     play_smithy(player, handPos, testGame) == 0
cardtest1.c:15 TEST FAILED: ->
     testGame->deckCount[player] == 2
cardtest1.c:16 TEST FAILED: ->
     testGame->handCount[player] == 7
cardtest1.c:19 TEST SUCCESSFULLY COMPLETED ->
     testGame->deckCount[player] == 0
cardtest1.c:20 TEST SUCCESSFULLY COMPLETED ->
     testGame->handCount[player] == 8
     #+END_EXAMPLE
    

