projects/beckmanl/dominion/Assignment-5.tex
% Created 2019-03-16 Sat 23:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{/home/liam/main.tex}
\author{liam beckman}
\date{\today}
\title{Assignment 5}
\hypersetup{
 pdfauthor={liam beckman},
 pdftitle={Assignment 5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Bugs Report}
\label{sec:bugsreport}
\subsection{Bug 1}
\label{sec:bug}

\begin{itemize}
\item Title: Wrong Smithy draw card value.
\item Project: dominion
\item Reporter: liam beckman
\item Date: 16 March 2019
\item Type: Bug
\item File Name: cardtest1.c
\item Environment: NVIM v0.3.4 (Build type: Release)
\item Description:
\end{itemize}

The Smithy card (implemented in the \texttt{play\_smithy} function) drew a totoal of four cards, instead of the correct amount of three cards. This is likely due to the incorrect termination expression of \texttt{i < 4} in the primary for loop.

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int play_smithy(int currentPlayer, int handPos, struct gameState *state)
{
        //+3 Cards
      for (int i = 0; i < 4; i++)
    {
      drawCard(currentPlayer, state);
    }
            
      //discard card from hand
      discardCard(handPos, currentPlayer, state, 0);
      return 0;
}
\end{minted}

\subsection{Bug 2}
\label{sec:bug1}

\begin{itemize}
\item Title: Adventurer Card Error
\item Project: dominion
\item Reporter: liam beckman
\item Date: 16 March 2019
\item Type: Bug
\item File Name: cardtest2.c
\item Environment: NVIM v0.3.4 (Build type: Release)
\item Description:

Uninitialized variable \texttt{z} in \texttt{play\_adventurer} function within the \texttt{temphand[z]=cardDrawn} statement. Furthermore, the \texttt{z} variable is not incremented after the \texttt{temphand[z]=cardDrawn} statement, so the first temphand card will continualy be overwritten every iteration of the \texttt{while(drawntreasure<2)} statement.

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
while(drawntreasure<2)

//...

    if (cardDrawn == copper || cardDrawn == silver || cardDrawn == gold)
        drawntreasure++;
    else
    {
        temphand[z]=cardDrawn;
        state->
    handCount[currentPlayer]--; //this should just remove the top card (the most recently drawn one).
    }


\end{minted}
\end{itemize}

\section{Test Report}
\label{sec:testreport}

I chose to use Yan Ming's branch for their second assignment (yanme-assignment-2), as her later branches were such that no prominent bugs could be found. Thus, I am confident in saying that their code is reliable and well executed, as I was forced to analyze code with purposeful bugs implemented.

\subsection{Manual Review}
\label{sec:manualreview}
\subsubsection{cardEffect}
\label{sec:cardeffect}

Missing end bracket in \texttt{cardEffect} function.

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int cardEffect(int card, int choice1, int choice2, int choice3, struct gameState *state, int handPos, int *bonus)

// ...
\end{minted}


Variable misspelling of \texttt{drawnteasure} variable in \texttt{play\_adventurer} function. Initialized as \texttt{drawnteasure}.

\subsubsection{play\_adventurer}
\label{sec:playadventurer}

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int play_adventurer(int currentPlayer, int temphand[MAX_HAND],  struct gameState *state)


int drawnteasure = 0;
int cardDrawn;
while(drawntreasure<2)

    // ...
\end{minted}

Uninitialized variable \texttt{z} in \texttt{play\_adventurer} function within the \texttt{temphand[z]=cardDrawn} statement. Furthermore, the \texttt{z} variable is not incremented after the \texttt{temphand[z]=cardDrawn} statement, so the first temphand card will continualy be overwritten every iteration of the \texttt{while(drawntreasure<2)} statement.


\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
while(drawntreasure<2)

//...

    if (cardDrawn == copper || cardDrawn == silver || cardDrawn == gold)
        drawntreasure++;
    else
    {
        temphand[z]=cardDrawn;
        state->
    handCount[currentPlayer]--; //this should just remove the top card (the most recently drawn one).
    }


\end{minted}

\subsubsection{play\_smithy}
\label{sec:playsmithy}

Uninitialized variable \texttt{i} in \texttt{play\_smithy} function.

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int play_smithy(int currentPlayer, int handPos, struct gameState *state)

//+3 Cards
    for (i = 0; i < 4; i++)

        // ...
\end{minted}

\subsubsection{play\_mine}
\label{sec:playmine}

Uninitialized variables \texttt{j} and \texttt{i} in \texttt{play\_mine} function.

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int play_mine ( int currentPlayer, int choice1, int choice2, struct gameState *state)

    j = state->
    hand[currentPlayer][choice1];  //store card we will trash

// ...

//discard trashed card
for (i = 0; i < state->
    handCount[currentPlayer]; i++)
{
    if (state->
    hand[currentPlayer][i] == j)
    {
        discardCard(i, currentPlayer, state, 0);
        break;
    }
}

return 0;

\end{minted}

Undeclared variable \texttt{handPos} in \texttt{play\_mine} function.

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int play_mine ( int currentPlayer, int choice1, int choice2, struct gameState *state)

// ...

//discard card from hand
    discardCard(handPos, currentPlayer, state, 0);
\end{minted}

\subsubsection{play\_council}
\label{sec:playcouncil}

Uninitialized variable \texttt{i} in \texttt{play\_council} function.

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int play_council(int currentPlayer, int handPos, struct gameState *state)
{
    //+4 Cards
    for (i = 0; i < 4; i++)

        // ...
\end{minted}


\subsection{Unit Testing}
\label{sec:unittesting}

\subsubsection{Test Results}
\label{sec:testresults}

\begin{enumerate}
\item getCost Function
\label{sec:getcostfunction}
\begin{verbatim}
 1  unittest1.c:17 TEST SUCCESSFULLY COMPLETED ->
 2       getCost(0) == 0
 3  unittest1.c:20 TEST SUCCESSFULLY COMPLETED ->
 4       getCost(1) == 2
 5  unittest1.c:23 TEST SUCCESSFULLY COMPLETED ->
 6       getCost(2) == 5
 7  unittest1.c:26 TEST SUCCESSFULLY COMPLETED ->
 8       getCost(3) == 8
 9  unittest1.c:29 TEST SUCCESSFULLY COMPLETED ->
10       getCost(4) == 0
\end{verbatim}

\item isGameOver Function
\label{sec:isgameoverfunction}
\begin{verbatim}
1  unittest2.c:28 TEST SUCCESSFULLY COMPLETED ->
2       isGameOver(&testGame) == 0
3  unittest2.c:35 TEST SUCCESSFULLY COMPLETED ->
4       isGameOver(&testGame) == 1
5  unittest2.c:43 TEST SUCCESSFULLY COMPLETED ->
6       isGameOver(&testGame) == 0
7  unittest2.c:46 TEST SUCCESSFULLY COMPLETED ->
8       isGameOver(&testGame) == 1
\end{verbatim}

\item compare Function
\label{sec:comparefunction}
\begin{verbatim}
1  unittest3.c:14 TEST SUCCESSFULLY COMPLETED ->
2       compare(b, a) == 1
3  unittest3.c:15 TEST SUCCESSFULLY COMPLETED ->
4       compare(a, b) == -1
5  unittest3.c:16 TEST SUCCESSFULLY COMPLETED ->
6       compare(a, a) == 0
7  unittest3.c:17 TEST SUCCESSFULLY COMPLETED ->
8       compare(b, b) == 0
\end{verbatim}

\item updateCoins Function
\label{sec:updatecoinsfunction}
\begin{verbatim}
1  unittest4.c:31 TEST SUCCESSFULLY COMPLETED ->
2       testGame->coins == 9
3  unittest4.c:43 TEST SUCCESSFULLY COMPLETED ->
4       testGame->coins == 8
\end{verbatim}

\item Smithy Card
\label{sec:smithycard}

\begin{enumerate}
\item Failed Tests
\label{sec:failedtests}

\begin{verbatim}
 1  cardtest1.c:14 TEST SUCCESSFULLY COMPLETED ->
 2       play_smithy(player, handPos, testGame) == 0
 3  cardtest1.c:15 TEST FAILED: ->
 4       testGame->deckCount[player] == 2
 5  cardtest1.c:16 TEST FAILED: ->
 6       testGame->handCount[player] == 7
 7  cardtest1.c:19 TEST SUCCESSFULLY COMPLETED ->
 8       testGame->deckCount[player] == 0
 9  cardtest1.c:20 TEST SUCCESSFULLY COMPLETED ->
10       testGame->handCount[player] == 8
\end{verbatim}
