projects/beckmanl/dominion/Assignment-5.org
***** Successful Tests

     #+BEGIN_EXAMPLE -n
cardtest1.c:14 TEST SUCCESSFULLY COMPLETED ->
     play_smithy(player, handPos, testGame) == 0
cardtest1.c:15 TEST SUCCESSFULLY COMPLETED ->
     testGame->deckCount[player] == 2
cardtest1.c:16 TEST SUCCESSFULLY COMPLETED ->
     testGame->handCount[player] == 7
deck count: 2
hand count: 7
cardtest1.c:21 TEST SUCCESSFULLY COMPLETED ->
     testGame->deckCount[player] == 0
cardtest1.c:22 TEST SUCCESSFULLY COMPLETED ->
     testGame->handCount[player] == 8
File 'cardtest1.c'
Lines executed:100.00% of 14
Branches executed:100.00% of 10
Taken at least once:50.00% of 10
Calls executed:66.67% of 15
Creating 'cardtest1.c.gcov'
    #+END_EXAMPLE
    
***** Code Changed
    
 #+BEGIN_SRC c -n
int play_smithy(int currentPlayer, int handPos, struct gameState *state)
{
        //+3 Cards
        // changed "i < 4" to "i < 3"
      for (int i = 0; i < 3; i++)
    {
      drawCard(currentPlayer, state);
    }
            
      //discard card from hand
      discardCard(handPos, currentPlayer, state, 0);
      return 0;
}
 #+END_SRC


**** Adventurer Card
     #+BEGIN_EXAMPLE -n
cardtest2.c:19 TEST SUCCESSFULLY COMPLETED ->
     play_adventurer(player, temphand, testGame) == 0
cardtest2.c:22 TEST SUCCESSFULLY COMPLETED ->
     lastCard == copper || lastCard == silver || lastCard == gold
     #+END_EXAMPLE

**** Village Card
     #+BEGIN_EXAMPLE -n
cardtest3.c:31 TEST SUCCESSFULLY COMPLETED ->
     cardEffect(card, choice1, choice2, choice3, testGame, handPos, bonus) == 0
cardtest3.c:35 TEST SUCCESSFULLY COMPLETED ->
     actions == actionsOld + 2
     #+END_EXAMPLE

**** Mine Card
     #+BEGIN_EXAMPLE -n
cardtest4.c:21 TEST SUCCESSFULLY COMPLETED ->
     play_mine(player, choice1, choice2, testGame, handPos) == 0
     #+END_EXAMPLE

*** Code Coverage

**** getCost Function
     #+BEGIN_EXAMPLE -n
File 'unittest1.c'
Lines executed:100.00% of 6
Branches executed:100.00% of 10
Taken at least once:50.00% of 10
Calls executed:66.67% of 15
Creating 'unittest1.c.gcov'

File 'dominion.c'
Lines executed:2.00% of 599
Branches executed:6.85% of 409
Taken at least once:1.22% of 409
Calls executed:0.00% of 92
Creating 'dominion.c.gcov'
     #+END_EXAMPLE
    
**** isGameOver Function
     #+BEGIN_EXAMPLE -n
File 'unittest2.c'
Lines executed:100.00% of 17
Branches executed:100.00% of 12
Taken at least once:66.67% of 12
Calls executed:71.43% of 14
Creating 'unittest2.c.gcov'

File 'dominion.c'
Lines executed:1.67% of 599
Branches executed:1.96% of 409
Taken at least once:1.96% of 409
Calls executed:0.00% of 92
Creating 'dominion.c.gcov'
     #+END_EXAMPLE
    
**** compare Function
     #+BEGIN_EXAMPLE -n
File 'unittest3.c'
Lines executed:100.00% of 9
Branches executed:100.00% of 8
Taken at least once:50.00% of 8
Calls executed:66.67% of 12
Creating 'unittest3.c.gcov'

File 'dominion.c'
Lines executed:1.00% of 599
Branches executed:0.98% of 409
Taken at least once:0.98% of 409
Calls executed:0.00% of 92
Creating 'dominion.c.gcov'
     #+END_EXAMPLE
    
**** updateCoins Function
     #+BEGIN_EXAMPLE -n
File 'unittest4.c'
Lines executed:100.00% of 25
Branches executed:100.00% of 4
Taken at least once:50.00% of 4
Calls executed:77.78% of 9
Creating 'unittest4.c.gcov'

File 'dominion.c'
Lines executed:2.34% of 599
Branches executed:1.96% of 409
Taken at least once:1.71% of 409
Calls executed:0.00% of 92
Creating 'dominion.c.gcov'
     #+END_EXAMPLE

**** Smithy Card
     #+BEGIN_EXAMPLE -n
File 'cardtest1.c'
Lines executed:100.00% of 12
Branches executed:100.00% of 10
Taken at least once:50.00% of 10
Calls executed:61.54% of 13
Creating 'cardtest1.c.gcov'
     #+END_EXAMPLE

**** Adventurer Card
     #+BEGIN_EXAMPLE -n
File 'cardtest2.c'
Lines executed:100.00% of 13
Branches executed:50.00% of 8
Taken at least once:25.00% of 8
Calls executed:71.43% of 7
Creating 'cardtest2.c.gcov'
     #+END_EXAMPLE

**** Village Card
     #+BEGIN_EXAMPLE -n
File 'cardtest3.c'
Lines executed:100.00% of 19
Branches executed:100.00% of 4
Taken at least once:50.00% of 4
Calls executed:71.43% of 7
Creating 'cardtest3.c.gcov'
     #+END_EXAMPLE

**** Mine Card
     #+BEGIN_EXAMPLE -n
File 'cardtest4.c'
Lines executed:100.00% of 11
Branches executed:100.00% of 2
Taken at least once:50.00% of 2
Calls executed:80.00% of 5
Creating 'cardtest4.c.gcov'
     #+END_EXAMPLE

** Random Testing

*** Test Results  
   
**** Smithy
     #+BEGIN_EXAMPLE -n
numPlayers: 4
thisPlayer: 3
----------------- Testing Card: smithy ----------------
TEST 1: random test
randomtestcard1.c:65 TEST SUCCESSFULLY COMPLETED ->
     testG.handCount[thisPlayer] == G.handCount[thisPlayer] + 2
randomtestcard1.c:66 TEST SUCCESSFULLY COMPLETED ->
     testG.deckCount[thisPlayer] == G.deckCount[thisPlayer] - 3

 >>>>> SUCCESS: Testing complete smithy <<<<<
     #+END_EXAMPLE

**** Mine
     #+BEGIN_EXAMPLE -n
----------------- Testing Card: mine ----------------
TEST 1: random test
randomtestcard2.c:56 TEST SUCCESSFULLY COMPLETED ->
     getCost(testG.hand[thisPlayer][choice1]) + 3 <= getCost(choice2)
randomtestcard2.c:65 TEST SUCCESSFULLY COMPLETED ->
     testG.handCount[thisPlayer] == G.handCount[thisPlayer]
randomtestcard2.c:71 TEST SUCCESSFULLY COMPLETED ->
     testG.supplyCount[choice2] == G.supplyCount[choice2]

 >>>>> SUCCESS: Testing complete mine <<<<<
     #+END_EXAMPLE

**** Adventurer
     #+BEGIN_EXAMPLE -n
numplayers: 4
thisplayer: 3
----------------- Testing Card: adventurer ----------------
TEST 1: random test
randomtestcardadventurer.c:88 TEST SUCCESSFULLY COMPLETED ->
     drawntreasure == drawntreasurePre + 2

 >>>>> SUCCESS: Testing complete adventurer <<<<<
    
     #+END_EXAMPLE

*** Code Coverage

**** Smithy
     #+BEGIN_EXAMPLE -n
File 'randomtestcard1.c'
Lines executed:100.00% of 23
Branches executed:100.00% of 4
Taken at least once:50.00% of 4
Calls executed:88.24% of 17
Creating 'randomtestcard1.c.gcov'

File 'myAssert.c'
Lines executed:35.71% of 14
Branches executed:50.00% of 8
Taken at least once:25.00% of 8
Calls executed:16.67% of 6
Creating 'myAssert.c.gcov'
     #+END_EXAMPLE

**** Mine
     #+BEGIN_EXAMPLE -n
File 'randomtestcard2.c'
Lines executed:100.00% of 23
Branches executed:100.00% of 8
Taken at least once:62.50% of 8
Calls executed:86.36% of 22
Creating 'randomtestcard2.c.gcov'

File 'myAssert.c'
Lines executed:71.43% of 14
Branches executed:100.00% of 8
Taken at least once:50.00% of 8
Calls executed:33.33% of 6
Creating 'myAssert.c.gcov'
    
     #+END_EXAMPLE

**** Adventurer
     #+BEGIN_EXAMPLE -n
File 'randomtestcardadventurer.c'
Lines executed:81.82% of 33
Branches executed:33.33% of 18
Taken at least once:16.67% of 18
Calls executed:92.31% of 13
Creating 'randomtestcardadventurer.c.gcov'

File 'myAssert.c'
Lines executed:35.71% of 14
Branches executed:50.00% of 8
Taken at least once:25.00% of 8
Calls executed:16.67% of 6
Creating 'myAssert.c.gcov'
     #+END_EXAMPLE


* Debugging
