projects/beckmanl/dominion/Assignment-5.tex


\item Successful Tests
\label{sec:successfultests}

\begin{verbatim}
 1  cardtest1.c:14 TEST SUCCESSFULLY COMPLETED ->
 2       play_smithy(player, handPos, testGame) == 0
 3  cardtest1.c:15 TEST SUCCESSFULLY COMPLETED ->
 4       testGame->deckCount[player] == 2
 5  cardtest1.c:16 TEST SUCCESSFULLY COMPLETED ->
 6       testGame->handCount[player] == 7
 7  deck count: 2
 8  hand count: 7
 9  cardtest1.c:21 TEST SUCCESSFULLY COMPLETED ->
10       testGame->deckCount[player] == 0
11  cardtest1.c:22 TEST SUCCESSFULLY COMPLETED ->
12       testGame->handCount[player] == 8
13  File 'cardtest1.c'
14  Lines executed:100.00% of 14
15  Branches executed:100.00% of 10
16  Taken at least once:50.00% of 10
17  Calls executed:66.67% of 15
18  Creating 'cardtest1.c.gcov'
\end{verbatim}

\item Code Changed
\label{sec:codechanged}

\begin{minted}[linenos,firstnumber=1,breaklines=true,breakanywhere=true]{c}
int play_smithy(int currentPlayer, int handPos, struct gameState *state)
{
        //+3 Cards
        // changed "i < 4" to "i < 3"
      for (int i = 0; i < 3; i++)
    {
      drawCard(currentPlayer, state);
    }
            
      //discard card from hand
      discardCard(handPos, currentPlayer, state, 0);
      return 0;
}
\end{minted}
\end{enumerate}


\item Adventurer Card
\label{sec:adventurercard}
\begin{verbatim}
1  cardtest2.c:19 TEST SUCCESSFULLY COMPLETED ->
2       play_adventurer(player, temphand, testGame) == 0
3  cardtest2.c:22 TEST SUCCESSFULLY COMPLETED ->
4       lastCard == copper || lastCard == silver || lastCard == gold
\end{verbatim}

\item Village Card
\label{sec:villagecard}
\begin{verbatim}
1  cardtest3.c:31 TEST SUCCESSFULLY COMPLETED ->
2       cardEffect(card, choice1, choice2, choice3, testGame, handPos, bonus) == 0
3  cardtest3.c:35 TEST SUCCESSFULLY COMPLETED ->
4       actions == actionsOld + 2
\end{verbatim}

\item Mine Card
\label{sec:minecard}
\begin{verbatim}
1  cardtest4.c:21 TEST SUCCESSFULLY COMPLETED ->
2       play_mine(player, choice1, choice2, testGame, handPos) == 0
\end{verbatim}
\end{enumerate}

\subsubsection{Code Coverage}
\label{sec:codecoverage}

\begin{enumerate}
\item getCost Function
\label{sec:getcostfunction1}
\begin{verbatim}
 1  File 'unittest1.c'
 2  Lines executed:100.00% of 6
 3  Branches executed:100.00% of 10
 4  Taken at least once:50.00% of 10
 5  Calls executed:66.67% of 15
 6  Creating 'unittest1.c.gcov'
 7  
 8  File 'dominion.c'
 9  Lines executed:2.00% of 599
10  Branches executed:6.85% of 409
11  Taken at least once:1.22% of 409
12  Calls executed:0.00% of 92
13  Creating 'dominion.c.gcov'
\end{verbatim}

\item isGameOver Function
\label{sec:isgameoverfunction1}
\begin{verbatim}
 1  File 'unittest2.c'
 2  Lines executed:100.00% of 17
 3  Branches executed:100.00% of 12
 4  Taken at least once:66.67% of 12
 5  Calls executed:71.43% of 14
 6  Creating 'unittest2.c.gcov'
 7  
 8  File 'dominion.c'
 9  Lines executed:1.67% of 599
10  Branches executed:1.96% of 409
11  Taken at least once:1.96% of 409
12  Calls executed:0.00% of 92
13  Creating 'dominion.c.gcov'
\end{verbatim}

\item compare Function
\label{sec:comparefunction1}
\begin{verbatim}
 1  File 'unittest3.c'
 2  Lines executed:100.00% of 9
 3  Branches executed:100.00% of 8
 4  Taken at least once:50.00% of 8
 5  Calls executed:66.67% of 12
 6  Creating 'unittest3.c.gcov'
 7  
 8  File 'dominion.c'
 9  Lines executed:1.00% of 599
10  Branches executed:0.98% of 409
11  Taken at least once:0.98% of 409
12  Calls executed:0.00% of 92
13  Creating 'dominion.c.gcov'
\end{verbatim}

\item updateCoins Function
\label{sec:updatecoinsfunction1}
\begin{verbatim}
 1  File 'unittest4.c'
 2  Lines executed:100.00% of 25
 3  Branches executed:100.00% of 4
 4  Taken at least once:50.00% of 4
 5  Calls executed:77.78% of 9
 6  Creating 'unittest4.c.gcov'
 7  
 8  File 'dominion.c'
 9  Lines executed:2.34% of 599
10  Branches executed:1.96% of 409
11  Taken at least once:1.71% of 409
12  Calls executed:0.00% of 92
13  Creating 'dominion.c.gcov'
\end{verbatim}

\item Smithy Card
\label{sec:smithycard1}
\begin{verbatim}
1  File 'cardtest1.c'
2  Lines executed:100.00% of 12
3  Branches executed:100.00% of 10
4  Taken at least once:50.00% of 10
5  Calls executed:61.54% of 13
6  Creating 'cardtest1.c.gcov'
\end{verbatim}

\item Adventurer Card
\label{sec:adventurercard1}
\begin{verbatim}
1  File 'cardtest2.c'
2  Lines executed:100.00% of 13
3  Branches executed:50.00% of 8
4  Taken at least once:25.00% of 8
5  Calls executed:71.43% of 7
6  Creating 'cardtest2.c.gcov'
\end{verbatim}

\item Village Card
\label{sec:villagecard1}
\begin{verbatim}
1  File 'cardtest3.c'
2  Lines executed:100.00% of 19
3  Branches executed:100.00% of 4
4  Taken at least once:50.00% of 4
5  Calls executed:71.43% of 7
6  Creating 'cardtest3.c.gcov'
\end{verbatim}

\item Mine Card
\label{sec:minecard1}
\begin{verbatim}
1  File 'cardtest4.c'
2  Lines executed:100.00% of 11
3  Branches executed:100.00% of 2
4  Taken at least once:50.00% of 2
5  Calls executed:80.00% of 5
6  Creating 'cardtest4.c.gcov'
\end{verbatim}
\end{enumerate}

\subsection{Random Testing}
\label{sec:randomtesting}

\subsubsection{Test Results}
\label{sec:testresults1}

\begin{enumerate}
\item Smithy
\label{sec:smithy}
\begin{verbatim}
 1  numPlayers: 4
 2  thisPlayer: 3
 3  ----------------- Testing Card: smithy ----------------
 4  TEST 1: random test
 5  randomtestcard1.c:65 TEST SUCCESSFULLY COMPLETED ->
 6       testG.handCount[thisPlayer] == G.handCount[thisPlayer] + 2
 7  randomtestcard1.c:66 TEST SUCCESSFULLY COMPLETED ->
 8       testG.deckCount[thisPlayer] == G.deckCount[thisPlayer] - 3
 9  
10   >>>>> SUCCESS: Testing complete smithy <<<<<
\end{verbatim}

\item Mine
\label{sec:mine}
\begin{verbatim}
 1  ----------------- Testing Card: mine ----------------
 2  TEST 1: random test
 3  randomtestcard2.c:56 TEST SUCCESSFULLY COMPLETED ->
 4       getCost(testG.hand[thisPlayer][choice1]) + 3 <= getCost(choice2)
 5  randomtestcard2.c:65 TEST SUCCESSFULLY COMPLETED ->
 6       testG.handCount[thisPlayer] == G.handCount[thisPlayer]
 7  randomtestcard2.c:71 TEST SUCCESSFULLY COMPLETED ->
 8       testG.supplyCount[choice2] == G.supplyCount[choice2]
 9  
10   >>>>> SUCCESS: Testing complete mine <<<<<
\end{verbatim}

\item Adventurer
\label{sec:adventurer}
\begin{verbatim}
1  numplayers: 4
2  thisplayer: 3
3  ----------------- Testing Card: adventurer ----------------
4  TEST 1: random test
5  randomtestcardadventurer.c:88 TEST SUCCESSFULLY COMPLETED ->
6       drawntreasure == drawntreasurePre + 2
7  
8   >>>>> SUCCESS: Testing complete adventurer <<<<<
9      
\end{verbatim}
\end{enumerate}

\subsubsection{Code Coverage}
\label{sec:codecoverage1}

\begin{enumerate}
\item Smithy
\label{sec:smithy1}
\begin{verbatim}
 1  File 'randomtestcard1.c'
 2  Lines executed:100.00% of 23
 3  Branches executed:100.00% of 4
 4  Taken at least once:50.00% of 4
 5  Calls executed:88.24% of 17
 6  Creating 'randomtestcard1.c.gcov'
 7  
 8  File 'myAssert.c'
 9  Lines executed:35.71% of 14
10  Branches executed:50.00% of 8
11  Taken at least once:25.00% of 8
12  Calls executed:16.67% of 6
13  Creating 'myAssert.c.gcov'
\end{verbatim}

\item Mine
\label{sec:mine1}
\begin{verbatim}
 1  File 'randomtestcard2.c'
 2  Lines executed:100.00% of 23
 3  Branches executed:100.00% of 8
 4  Taken at least once:62.50% of 8
 5  Calls executed:86.36% of 22
 6  Creating 'randomtestcard2.c.gcov'
 7  
 8  File 'myAssert.c'
 9  Lines executed:71.43% of 14
10  Branches executed:100.00% of 8
11  Taken at least once:50.00% of 8
12  Calls executed:33.33% of 6
13  Creating 'myAssert.c.gcov'
14      
\end{verbatim}

\item Adventurer
\label{sec:adventurer1}
\begin{verbatim}
 1  File 'randomtestcardadventurer.c'
 2  Lines executed:81.82% of 33
 3  Branches executed:33.33% of 18
 4  Taken at least once:16.67% of 18
 5  Calls executed:92.31% of 13
 6  Creating 'randomtestcardadventurer.c.gcov'
 7  
 8  File 'myAssert.c'
 9  Lines executed:35.71% of 14
10  Branches executed:50.00% of 8
11  Taken at least once:25.00% of 8
12  Calls executed:16.67% of 6
13  Creating 'myAssert.c.gcov'
\end{verbatim}
\end{enumerate}
