projects/beckmanl/dominion/Assignment-5.org
** gdb
   
The GNU Debugger was used to track down a bug in the Smithy card in dominion.c (implemented in the ~play_smithy~ function). By creating a breakpoint at the ~play_smithy~ function, we were able to first confirm the initial values of the variables (hand count and deck count), and then step into the ~play_smithy~ function. In this case the example was readily apparent, as the ~for (int i = 0; i < 4; i++)~ statement should be ~for (int i = 0; i < 3; i++)~ for the Smithy card to draw the correct amount of three cards (and not four as the previous version had it doing).

#+BEGIN_EXAMPLE -n
$ gdb cardtest1
GNU gdb (GDB) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>                                                                         
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-pc-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from cardtest1...done.
(gdb) b 20                                                        
Breakpoint 1 at 0x2471: file cardtest1.c, line 20. 
(gdb) b 21                         
Breakpoint 2 at 0x2484: file cardtest1.c, line 21.
(gdb) r                            
Starting program: /home/liam/Documents/code/osu/2019winter/cs362-software/CS362-W2019/projects/yanmeDominion/projects/yanme/dominion/cardtest1        
cardtest1.c:14 TEST SUCCESSFULLY COMPLETED -> play_smithy(player, handPos, testGame) == 0                                                             
cardtest1.c:15 TEST SUCCESSFULLY COMPLETED -> testGame->deckCount[player] == 2                                                                        
cardtest1.c:16 TEST SUCCESSFULLY COMPLETED -> testGame->handCount[player] == 7                                                                        
deck count: 2                            
hand count: 7                      
                                        
Breakpoint 1, main (argc=1, argv=0x7fffffffe0d8) at cardtest1.c:20
20          play_smithy(player, handPos, testGame);      
(gdb) p testGame->deckCount[player]
$1 = 2                        
(gdb) p testGame->handCount[player]
$2 = 7                                           
(gdb) s
play_smithy (currentPlayer=0, handPos=0, state=0x555555569260)
    at dominion.c:681
681           for (int i = 0; i < 4; i++)
(gdb) s
683               drawCard(currentPlayer, state);
(gdb) c
Continuing.                          
Breakpoint 2, main (argc=1, argv=0x7fffffffe0d8) at cardtest1.c:21
21          myAssert(testGame->deckCount[player] == 0);
(gdb) p testGame->deckCount[player]                                                                                                                   
$3 = 0                                                            
(gdb) p testGame->handCount[player]                  
$4 = 8                                              
(gdb) q                                          
A debugging session is active.                      
                                           
        Inferior 1 [process 2873] will be killed.
                                                                
Quit anyway? (y or n) y     
#+END_EXAMPLE
