projects/beckmanl/dominion/Assignment-5.tex


\section{Debugging}
\label{sec:debugging}
\subsection{gdb}
\label{sec:gdb}

The GNU Debugger was used to track down a bug in the Smithy card in dominion.c (implemented in the \texttt{play\_smithy} function). By creating a breakpoint at the \texttt{play\_smithy} function, we were able to first confirm the initial values of the variables (hand count and deck count), and then step into the \texttt{play\_smithy} function. In this case the example was readily apparent, as the \texttt{for (int i = 0; i < 4; i++)} statement should be \texttt{for (int i = 0; i < 3; i++)} for the Smithy card to draw the correct amount of three cards (and not four as the previous version had it doing).

\begin{verbatim}
 1  $ gdb cardtest1
 2  GNU gdb (GDB) 8.2.1
 3  Copyright (C) 2018 Free Software Foundation, Inc.
 4  License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>                                                                         
 5  This is free software: you are free to change and redistribute it.
 6  There is NO WARRANTY, to the extent permitted by law.
 7  Type "show copying" and "show warranty" for details.
 8  This GDB was configured as "x86_64-pc-linux-gnu".
 9  Type "show configuration" for configuration details.
10  For bug reporting instructions, please see:
11  <http://www.gnu.org/software/gdb/bugs/>.
12  Find the GDB manual and other documentation resources online at:
13  For help, type "help".
14  Type "apropos word" to search for commands related to "word"...
15  Reading symbols from cardtest1...done.
16  (gdb) b 20                                                        
17  Breakpoint 1 at 0x2471: file cardtest1.c, line 20. 
18  (gdb) b 21                         
19  Breakpoint 2 at 0x2484: file cardtest1.c, line 21.
20  (gdb) r                            
21  Starting program: /home/liam/Documents/code/osu/2019winter/cs362-software/CS362-W2019/projects/yanmeDominion/projects/yanme/dominion/cardtest1        
22  cardtest1.c:14 TEST SUCCESSFULLY COMPLETED -> play_smithy(player, handPos, testGame) == 0                                                             
23  cardtest1.c:15 TEST SUCCESSFULLY COMPLETED -> testGame->deckCount[player] == 2                                                                        
24  cardtest1.c:16 TEST SUCCESSFULLY COMPLETED -> testGame->handCount[player] == 7                                                                        
25  deck count: 2                            
26  hand count: 7                      
27                                          
28  Breakpoint 1, main (argc=1, argv=0x7fffffffe0d8) at cardtest1.c:20
29  20          play_smithy(player, handPos, testGame);      
30  (gdb) p testGame->deckCount[player]
31  $1 = 2                        
32  (gdb) p testGame->handCount[player]
33  $2 = 7                                           
34  (gdb) s
35  play_smithy (currentPlayer=0, handPos=0, state=0x555555569260)
36      at dominion.c:681
37  681           for (int i = 0; i < 4; i++)
38  (gdb) s
39  683               drawCard(currentPlayer, state);
40  (gdb) c
41  Continuing.                          
42  Breakpoint 2, main (argc=1, argv=0x7fffffffe0d8) at cardtest1.c:21
43  21          myAssert(testGame->deckCount[player] == 0);
44  (gdb) p testGame->deckCount[player]                                                                                                                   
45  $3 = 0                                                            
46  (gdb) p testGame->handCount[player]                  
47  $4 = 8                                              
48  (gdb) q                                          
49  A debugging session is active.                      
50                                             
51          Inferior 1 [process 2873] will be killed.
52                                                                  
53  Quit anyway? (y or n) y     
\end{verbatim}
\end{document}